"""
Модуль содержит текстовые константы для пользовательского интерфейса (UI).

Эти тексты используются для приветственных сообщений, системных уведомлений
и других элементов UI, отображаемых пользователю.
"""

START_GREETING = """
👋 **Добро пожаловать, {first_name}!**

Это интерактивный чат бот, который погрузит тебя в игровой мир.

Пока что у нас pre_alpha версия бота и всего игрового мира.

"""

DEFAULT_ACTOR_NAME = "⚙️ system"


TEXT_AWAIT = f"""

{DEFAULT_ACTOR_NAME}:  ****** Идет обработка данных ***** 


"""
